#ifndef _AEC_
#define _AEC_
#define AEC_LCU 1
#define MAP_SCU_N 0 //map informations in SCU level 
#define AEC_STAGE3_DEBUG 0 
#define AEC_STAGE3_PHASE2_DEBUG 0
#define AEC_STAGE1_2_DEBUG 0 
#define AEC_STAGE3_ONE_PORT 1 

#if AEC_STAGE3_DEBUG
#define AEC_STAGE3_CTX_DEBUG 1
#define AEC_STAGE3_BINA_DEBUG 0
#define AEC_STAGE3_BS_DEBUG 1
#endif

#if AEC_STAGE3_PHASE2_DEBUG
#define AEC_STAGE3_CTX_PHASE2_DEBUG 1
#define AEC_STAGE3_RLPS_PHASE2_DEBUG 0
#define AEC_STAGE3_BINA_PHASE2_DEBUG 0
#define AEC_STAGE3_BS_PHASE2_DEBUG 1
#endif

#if AEC_STAGE3_DEBUG
#if AEC_STAGE3_CTX_DEBUG 
extern FILE * fp_ctx ;
#endif
#if AEC_STAGE3_BS_DEBUG
extern FILE * fp_bs  ;
#endif
#if AEC_STAGE3_BINA_DEBUG
extern FILE * fp_bina;
#endif
#endif

#if AEC_STAGE3_PHASE2_DEBUG
#if AEC_STAGE3_CTX_PHASE2_DEBUG 
extern FILE* fp_ctx;
#endif
#if AEC_STAGE3_RLPS_PHASE2_DEBUG
extern FILE* fp_rLPS;
#endif
#if AEC_STAGE3_BS_PHASE2_DEBUG
extern FILE* fp_bs;
extern int enc_flag;
#endif
#if AEC_STAGE3_BINA_PHASE2_DEBUG
extern FILE* fp_bina;
#endif
#endif
#if AEC_STAGE1_2_DEBUG
extern FILE* fpStream;
extern FILE* fpMvd;
extern FILE* fpStream ;
extern FILE* fpMvd ;
extern FILE* fpPb ;
extern FILE* fpTb ;
extern FILE* fpPm ;
extern FILE* fpMvr ;
extern FILE* fpUmvF ;
extern FILE* fpUmvI ;
extern FILE* fpSkipI ;
extern FILE* fpAff ;
extern FILE* fpIpf ;
extern FILE* fpMvp ;
extern FILE* fpMpm ;
extern FILE* fpIpm ;
extern FILE* fpRefi ;
extern FILE* fpNumC ;
extern FILE* fpInfo;
extern FILE* fpSqh;
extern FILE* fpRpm ;
extern FILE* fpCoef;
extern FILE* fpRes ;
extern FILE* fpFoutI  ;
extern FILE* fpMapIn  ;
extern FILE* fpModIn  ;
extern FILE* fpScuAb  ;
extern FILE* fpCuAb   ;
extern FILE* fpTest;
#endif
//extern  CTU_Level_Parameters fetch_output;
#if 0 
typedef struct _AEC_COM_SBAC_CTX
{
	SBAC_CTX_MODEL   skip_flag[NUM_SBAC_CTX_SKIP_FLAG];//4
	SBAC_CTX_MODEL   skip_idx_ctx[NUM_SBAC_CTX_SKIP_IDX];//10
	SBAC_CTX_MODEL   direct_flag[NUM_SBAC_CTX_DIRECT_FLAG];//2
	SBAC_CTX_MODEL   umve_flag;
	SBAC_CTX_MODEL   umve_base_idx[NUM_SBAC_CTX_UMVE_BASE_IDX];//1
	SBAC_CTX_MODEL   umve_step_idx[NUM_SBAC_CTX_UMVE_STEP_IDX];//1
	SBAC_CTX_MODEL   umve_dir_idx[NUM_SBAC_CTX_UMVE_DIR_IDX];//2

	SBAC_CTX_MODEL   inter_dir[NUM_INTER_DIR_CTX];//3
	SBAC_CTX_MODEL   intra_dir[NUM_INTRA_DIR_CTX];//10
	SBAC_CTX_MODEL   pred_mode[NUM_PRED_MODE_CTX];//6
#if MODE_CONS
	SBAC_CTX_MODEL   cons_mode[NUM_CONS_MODE_CTX];//1
#endif
	SBAC_CTX_MODEL   ipf_flag[NUM_IPF_CTX];//1
	SBAC_CTX_MODEL   refi[NUM_REFI_CTX];//3
	SBAC_CTX_MODEL   mvr_idx[NUM_MVR_IDX_CTX];//4
#if BD_AFFINE_AMVR
	SBAC_CTX_MODEL   affine_mvr_idx[NUM_AFFINE_MVR_IDX_CTX];//2
#endif
#if EXT_AMVR_HMVP
	SBAC_CTX_MODEL   mvp_from_hmvp_flag[NUM_EXTEND_AMVR_FLAG];//1
#endif
	SBAC_CTX_MODEL   mvd[2][NUM_MV_RES_CTX];//2*3
	SBAC_CTX_MODEL   ctp_zero_flag[NUM_CTP_ZERO_FLAG_CTX];//2
	SBAC_CTX_MODEL   cbf[NUM_QT_CBF_CTX];//3
	SBAC_CTX_MODEL   tb_split[NUM_TB_SPLIT_CTX];//1
	SBAC_CTX_MODEL   run[NUM_SBAC_CTX_RUN];//24
	SBAC_CTX_MODEL   run_rdoq[NUM_SBAC_CTX_RUN];//24
	SBAC_CTX_MODEL   last1[NUM_SBAC_CTX_LAST1 * 2];//12
	SBAC_CTX_MODEL   last2[NUM_SBAC_CTX_LAST2 * 2 - 2];//22
	SBAC_CTX_MODEL   level[NUM_SBAC_CTX_LEVEL];//24
	SBAC_CTX_MODEL   split_flag[NUM_SBAC_CTX_SPLIT_FLAG];//4
	SBAC_CTX_MODEL   bt_split_flag[NUM_SBAC_CTX_BT_SPLIT_FLAG];//9
	SBAC_CTX_MODEL   split_dir[NUM_SBAC_CTX_SPLIT_DIR];//5
	SBAC_CTX_MODEL   split_mode[NUM_SBAC_CTX_SPLIT_MODE];//3
	SBAC_CTX_MODEL   affine_flag[NUM_SBAC_CTX_AFFINE_FLAG];//1
	SBAC_CTX_MODEL   affine_mrg_idx[NUM_SBAC_CTX_AFFINE_MRG];//4
#if SMVD
	SBAC_CTX_MODEL   smvd_flag[NUM_SBAC_CTX_SMVD_FLAG];//1
#endif
#if DT_SYNTAX
	SBAC_CTX_MODEL   part_size[NUM_SBAC_CTX_PART_SIZE];//6
#endif

	SBAC_CTX_MODEL   sao_merge_flag[NUM_SAO_MERGE_FLAG_CTX];//3
	SBAC_CTX_MODEL   sao_mode[NUM_SAO_MODE_CTX];//1
	SBAC_CTX_MODEL   sao_offset[NUM_SAO_OFFSET_CTX];//1
	SBAC_CTX_MODEL   alf_lcu_enable[NUM_ALF_LCU_CTX];//1
	SBAC_CTX_MODEL   delta_qp[NUM_SBAC_CTX_DELTA_QP];//4
} AEC_COM_SBAC_CTX;
#else
typedef struct _AEC_COM_SBAC_CTX
{
	SBAC_CTX_MODEL   delta_qp[NUM_SBAC_CTX_DELTA_QP];          //4: 0~3
	SBAC_CTX_MODEL   sao_merge_flag[NUM_SAO_MERGE_FLAG_CTX];   //3: 4~6
	SBAC_CTX_MODEL   sao_mode[NUM_SAO_MODE_CTX];               //1: 7
	SBAC_CTX_MODEL   sao_offset[NUM_SAO_OFFSET_CTX];           //1: 8
	SBAC_CTX_MODEL   alf_lcu_enable[NUM_ALF_LCU_CTX];          //1: 9
	SBAC_CTX_MODEL   split_flag[NUM_SBAC_CTX_SPLIT_FLAG];      //4: 10~13
	SBAC_CTX_MODEL   bt_split_flag[NUM_SBAC_CTX_BT_SPLIT_FLAG];//9: 14~22
	SBAC_CTX_MODEL   split_mode[NUM_SBAC_CTX_SPLIT_MODE];      //3: 23~25
	SBAC_CTX_MODEL   split_dir[NUM_SBAC_CTX_SPLIT_DIR];        //5: 26~30
#if MODE_CONS
	SBAC_CTX_MODEL   cons_mode[NUM_CONS_MODE_CTX];             //1: 31
#endif
	//intra_dir: chroma: 32~34
	//cbf: U: 35, V: 36
	SBAC_CTX_MODEL   skip_flag[NUM_SBAC_CTX_SKIP_FLAG];        //4: 37~40
	SBAC_CTX_MODEL   umve_flag;                                //1: 41
	SBAC_CTX_MODEL   affine_flag[NUM_SBAC_CTX_AFFINE_FLAG];    //1: 42
	SBAC_CTX_MODEL   direct_flag[NUM_SBAC_CTX_DIRECT_FLAG];    //2: 43~44
	SBAC_CTX_MODEL   pred_mode[NUM_PRED_MODE_CTX];             //6: 45~50
#if DT_SYNTAX
	SBAC_CTX_MODEL   part_size[NUM_SBAC_CTX_PART_SIZE];        //6: dt_split_flag:51, dt_split_dir:52, dt_split_hqt_flag:53, dt_split_vqt_flag:54, dt_split_hadt_flag:55, dt_split_vadt_flag:56
#endif
	SBAC_CTX_MODEL   umve_base_idx[NUM_SBAC_CTX_UMVE_BASE_IDX];//1: 57
	SBAC_CTX_MODEL   umve_step_idx[NUM_SBAC_CTX_UMVE_STEP_IDX];//1: 58
	SBAC_CTX_MODEL   umve_dir_idx[NUM_SBAC_CTX_UMVE_DIR_IDX];  //2: 59~60
	SBAC_CTX_MODEL   affine_mrg_idx[NUM_SBAC_CTX_AFFINE_MRG];  //4: 61~64
	SBAC_CTX_MODEL   skip_idx_ctx[NUM_SBAC_CTX_SKIP_IDX];      //10: 65~75
#if EXT_AMVR_HMVP
	SBAC_CTX_MODEL   mvp_from_hmvp_flag[NUM_EXTEND_AMVR_FLAG]; //1: 76
#endif
#if BD_AFFINE_AMVR
	SBAC_CTX_MODEL   affine_mvr_idx[NUM_AFFINE_MVR_IDX_CTX];   //2: 77~78
#endif
	SBAC_CTX_MODEL   mvr_idx[NUM_MVR_IDX_CTX];                 //4: 79~82
	SBAC_CTX_MODEL   inter_dir[NUM_INTER_DIR_CTX];             //3: 83~85
#if SMVD
	SBAC_CTX_MODEL   smvd_flag[NUM_SBAC_CTX_SMVD_FLAG];        //1: 86
#endif
	SBAC_CTX_MODEL   refi[NUM_REFI_CTX];                       //3: 87~89
	SBAC_CTX_MODEL   mvd[2][NUM_MV_RES_CTX];                   //2*3: 90~92 93~95
	SBAC_CTX_MODEL   intra_dir[NUM_INTRA_DIR_CTX];             //10: //luma: 96~102, chroma: 32~34
	SBAC_CTX_MODEL   ipf_flag[NUM_IPF_CTX];                    //1: 103
	SBAC_CTX_MODEL   ctp_zero_flag[NUM_CTP_ZERO_FLAG_CTX];     //2: 104~105
	SBAC_CTX_MODEL   tb_split[NUM_TB_SPLIT_CTX];               //1: 106
	SBAC_CTX_MODEL   cbf[NUM_QT_CBF_CTX];                      //3: Y: 107, U: 35, V: 36
	SBAC_CTX_MODEL   run[NUM_SBAC_CTX_RUN];                    //24: 108~131
	SBAC_CTX_MODEL   level[NUM_SBAC_CTX_LEVEL];                //24: 132~155
	SBAC_CTX_MODEL   last1[NUM_SBAC_CTX_LAST1 * 2];            //12: 156~167
	SBAC_CTX_MODEL   last2[NUM_SBAC_CTX_LAST2 * 2 - 2];        //22: 168~189

	SBAC_CTX_MODEL   run_rdoq[NUM_SBAC_CTX_RUN];//24
} AEC_COM_SBAC_CTX;
#endif
struct LINE_IDX {
	int line_idx_in_lcu_y;
	int line_idx_in_lcu_u;
	int line_idx_in_lcu_v;
};

extern int is_ipcm;

//extern SAOBlkParam cur_saoParam[N_C];
//extern SAOBlkParam rec_saoParam[MAX_NUM_LCU_ROW + 2][3];
#define test_AEC 

#if MAP_SCU_N
u32 MD2AEC_DATA_ARRAY_map_scu[256 * 2040];
u32 MD2AEC_DATA_ARRAY_map_cu_mode[256 * 2040];
s8  MD2AEC_DATA_ARRAY_map_patch_idx[256 * 2040];
#endif

typedef enum _N_ZIGZAG_CHOICE
{
	N_LEFT_TOWARDS = 0,
	N_RIGHT_UP      = 1,
	N_GO_UP       = 2,
	N_LEFT_DOWN     = 3,
} N_ZIGZAG_CHOICE;

typedef enum _ZIGZAG_CHOICE
{
	RIGHT_TOWARDS = 0,
	RIGHT_UP = 1,
	GO_DOWN = 2,
	LEFT_DOWN = 3,
} ZIGZAG_CHOICE;
typedef struct _AEC_output
{
	int bs_cur;//inner
	u8  bs_tmp[3 *1024*1024];//output
	COM_BSW  bs;//output
	unsigned int byte_cnt;
} AEC_output;
extern AEC_output AEC_DATA_output;

typedef struct _AEC_input
{
